In [ ]:
!pip install pandas

In [3]:
import pandas as pd

In [12]:
# manipular os dados txt
df_txt = pd.read_csv("data/data.txt", header=None)
df_txt

       0
0   joao
1  maria
2  pedro
3  andre

In [14]:
# manipular os dados csv
df_csv = pd.read_csv("data/data.csv", header=None, sep=";")
df_csv

          0   1  2
0  henrique  50  m
1     maria  30  f
2      jose  18  m
3     pedro  26  m

In [16]:
df_csv.columns = ["nome","idade","sexo"]
df_csv

       nome  idade sexo
0  henrique     50    m
1     maria     30    f
2      jose     18    m
3     pedro     26    m

In [17]:
df_resultado = df_csv[df_csv["idade"] >= 30]
df_resultado

       nome  idade sexo
0  henrique     50    m
1     maria     30    f

In [15]:
# manipular os dados csv
df_json = pd.read_json("data/data.json")
df_json

       nome  idade sexo
0  henrique     50    m
1     maria     30    f
2      jose     18    m
3     pedro     26    m

In [19]:
import sqlite3 as conector
from os import path

caminho_banco = path.join("data", "database.db")
conexao = conector.connect(caminho_banco)

In [21]:
df_json.to_sql("temporaria2", con=conexao, if_exists="replace")

4